In [1]:
%load_ext sql

In [2]:
#%sql postgresql://student:student@127.0.0.1/sparkifydb
%sql postgresql://postgres:Ckmerrypos44!@127.0.0.1/sparkifydb

'Connected: postgres@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 7, 17, 41, 4, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 15, 'paid', 221, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"', None, None),
 (2, datetime.datetime(2018, 11, 9, 16, 34, 12, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 80, 'paid', 416, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', None, None),
 (3, datetime.datetime(2018, 11, 6, 20, 8, 57, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 97, 'paid', 293, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"', None, None),
 (4, datetime.datetime(2018, 11, 12, 17, 5, 45, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 73, 'paid', 294, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"', None, None),
 (5, datetime.datetime(2018, 11, 11, 19, 41, 45, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 80, 'paid', 435, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', None, None)]

In [7]:
%sql SELECT * FROM songplays WHERE song_id = 'SOGDBUF12A8C140FAA'

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[(744, datetime.datetime(2018, 11, 14, 5, 6, 3, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 10, 'free', 484, 'Washington-Arlington-Alexandria, DC-VA-MD-WV', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4"', 'AR558FS1187FB45658', 'SOGDBUF12A8C140FAA')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 57, 'Katherine', 'Gay', 'F', 'free'),
 (2, 33, 'Bronson', 'Harris', 'M', 'free'),
 (3, 39, 'Walter', 'Frye', 'M', 'free'),
 (4, 24, 'Layla', 'Griffin', 'F', 'paid'),
 (5, 12, 'Austin', 'Rosales', 'M', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOVYKGO12AB0187199', 'Crazy Mixed Up World', 'ARH4Z031187B9A71F2', 1961, Decimal('156.395')),
 ('SONYPOM12A8C13B2D7', 'I Think My Wife Is Running Around On Me (Taco Hell)', 'ARDNS031187B9924F0', 2005, Decimal('186.488')),
 ('SOINLJW12A8C13314C', 'City Slickers', 'AR8IEZO1187B99055E', 2008, Decimal('149.864')),
 ('SOPVXLX12A8C1402D5', 'Larger Than Life', 'AR3JMC51187B9AE49D', 1999, Decimal('236.251')),
 ('SODREIN12A58A7F2E5', 'A Whiter Shade Of Pale (Live @ Fillmore West)', 'ARLTWXK1187FB5A3F8', 0, Decimal('326.008'))]

In [6]:
%sql SELECT song_id FROM songs WHERE title = 'Intro';

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOGDBUF12A8C140FAA',)]

In [8]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARDNS031187B9924F0', 'Tim Wilson', 'Georgia', Decimal('32.678'), Decimal('-83.223')),
 ('ARKFYS91187B98E58F', 'Jeff And Sheri Easter', '', Decimal('0.000'), Decimal('0.000')),
 ('AROUOZZ1187B9ABE51', 'Willie Bobo', 'New York, NY [Spanish Harlem]', Decimal('40.792'), Decimal('-73.945')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.150'), Decimal('-90.049')),
 ('ARYKCQI1187FB3B18F', 'Tesla', '', Decimal('0.000'), Decimal('0.000'))]

In [9]:
%sql SELECT * FROM artists WHERE artist_id = 'ARB29H41187B98F0EF'

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARB29H41187B98F0EF', 'Terry Callier', 'Chicago', Decimal('41.884'), Decimal('-87.632'))]

In [10]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 9, 0, 30, 12, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 0, 9, 45, 11, 2018, 4),
 (datetime.datetime(2018, 11, 9, 20, 14, 21, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 20, 9, 45, 11, 2018, 4),
 (datetime.datetime(2018, 11, 13, 14, 41, 14, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 14, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 6, 18, 43, 31, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 18, 6, 45, 11, 2018, 1),
 (datetime.datetime(2018, 11, 7, 3, 3, 28, 796000, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 3, 7, 45, 11, 2018, 2)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).